tests/artillery/test.yml
config:
  target: 'https://digitalmonitor.tk'
  processor: "./artillery-functions.js"
  payload:
    # order: "sequence"
    - path: 'users.csv'
      fields:
        - "userId"
        - "userAccessToken"
    - path: 'orgs.csv'
      fields:
        - "orgId"
        - "orgAccessToken"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp to 50"
    - duration: 60
      arrivalRate: 50
      name: "mid load"
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Ramp to 100"
    - duration: 120
      arrivalRate: 100
      name: "desired capacity"
    - duration: 120
      arrivalRate: 100
      rampTo: 200
      name: "Ramp to 200"
    - duration: 120
      arrivalRate: 200
      name: "double capacity"
scenarios:
  - name: "Add usage log"
    weight: 99
    flow:
      - post:
          url: '/api/usage-logs'
          beforeRequest: "generateStartAndEndTime"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          json:
            startTime: "{{startTime}}"
            endTime: "{{endTime}}"
  - name: "View app usage"
    weight: 0.2
    flow:
      - get:
          url: '/api/users/{{userId}}/metrics/?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/metrics/applications?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data[0].application._id'
            as: 'appId'
      - think: 5
      - get:
          url: '/api/users/{{userId}}/metrics/applications/{{ appId }}?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
  - name: "View platform usage"
    weight: 0.2
    flow:
      - get:
          url: '/api/users/{{userId}}/metrics/?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/metrics/platforms?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.platforms[0]._id'
            as: 'platformId'
      - think: 5
      - get:
          url: '/api/users/{{userId}}/metrics/platforms/{{ platformId }}?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
  - name: "View and add new goal"
    weight: 0.2
    flow:
      - get:
          url: '/api/users/{{userId}}/metrics/?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/usage-goals'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/applications'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.applications[0]._id'
            as: 'appId'
      - get:
          url: '/api/platforms'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.platforms[0]._id'
            as: 'platformId'
      - get:
          url: '/api/periods'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.periods[0]._id'
            as: 'periodId'
      - think: 10
      - post:
          url: '/api/users/{{userId}}/usage-goals/'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          json:
            duration: 172800
            periodId: "{{periodId}}"
            applicationId: "{{appId}}"
            platformId: "{{platformId}}"
  - name: "View and add new monitoring exception"
    weight: 0.2
    flow:
      - get:
          url: '/api/users/{{userId}}/metrics/?fromTime={{fromTime}}&toTime={{toTime}}'
          beforeRequest: "generateFromAndToTimeLast7Days"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/monitoring-exceptions'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
      - think: 5
      - get:
          url: '/api/users/{{userId}}/applications'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.applications[0]._id'
            as: 'appId'
      - get:
          url: '/api/platforms'
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          capture:
            json: '$.data.platforms[0]._id'
            as: 'platformId'
      - think: 10
      - post:
          url: '/api/users/{{userId}}/monitoring-exceptions/'
          beforeRequest: "generateExceptionStartAndEndTime"
          headers:
            Authorization: "Bearer {{userAccessToken}}"
          json:
            applicationId: "{{appId}}"
            platformId: "{{platformId}}"
            startTime: "{{exceptionStartTime}}"
            endTime: "{{exceptionEndTime}}"
  - name: "Add organisation app and client"
    weight: 0.2
    flow:
      - get:
          url: '/api/organisations/{{orgId}}/applications'
          headers:
            Authorization: "Bearer {{orgAccessToken}}"
      - think: 5
      - post:
          url: '/api/organisations/{{orgId}}/applications'
          headers:
            Authorization: "Bearer {{orgAccessToken}}"
          json:
            name: "artillery_app"
          capture:
            json: '$.data.application._id'
            as: 'appId'
      - think: 5
      - get:
          url: '/api/organisations/{{orgId}}/applications/{{appId}}/clients'
          headers:
            Authorization: "Bearer {{orgAccessToken}}"
      - think: 5
      - get:
          url: '/api/platforms'
          headers:
            Authorization: "Bearer {{orgAccessToken}}"
          capture:
            json: '$.data.platforms[0]._id'
            as: 'platformId'
      - think: 10
      - post:
          url: '/api/organisations/{{orgId}}/applications/{{appId}}/clients'
          headers:
            Authorization: "Bearer {{orgAccessToken}}"
          json:
            name: "artillery_client"
            redirectUri: "https://artillery.io"
            platformId: "{{platformId}}"
          capture:
            json: '$.data.application._id'
            as: 'appId'